## 입력한 돈을 최소한의 지폐 ~ 동전까지 바꾸기

## 변수 선언
money, p50000, p10000, p5000, p1000, p500, p100, p50, p10 = [0] * 9

## 메인 코드 부분 ##
if __name__ == '__main__' :
    money = int(input('바꿀 돈 -->'))
    p50000 = money // 50000; money %= 50000
    p10000 = money // 10000; money %= 10000
    p5000 = money // 5000; money %= 5000
    p1000 = money // 1000; money %= 1000
    c500 = money // 500; money %= 500
    c100 = money // 100; money %= 100
    c50 = money // 50; money %= 50
    c10 = money // 10; money %= 10

    print('50000원:', p50000, ', 10000원:', p10000,
          ', 5000원:', p5000, ', 1000원:', p1000,
          ', 500원:', c500, ', 100원:', c100, ', 50원:', c50 ,
          ', 10원:', c10, ', 나머지:', money)